Paciente8159/uCNC/uCNC/src/hal/mcus/esp32/mcumap_esp32.h
#define DOUT18_INREG IN0
#else
#define DOUT18_OUTREG OUT1
#define DOUT18_INREG IN1
#endif
#define DIO65 65
#define DIO65_BIT DOUT18_BIT
#define DIO65_OUTREG DOUT18_OUTREG
#define DIO65_INREG DOUT18_INREG
#endif
#if (defined(DOUT19_BIT))
#define DOUT19 66
#if (DOUT19_BIT < 32)
#define DOUT19_OUTREG OUT0
#define DOUT19_INREG IN0
#else
#define DOUT19_OUTREG OUT1
#define DOUT19_INREG IN1
#endif
#define DIO66 66
#define DIO66_BIT DOUT19_BIT
#define DIO66_OUTREG DOUT19_OUTREG
#define DIO66_INREG DOUT19_INREG
#endif
#if (defined(DOUT20_BIT))
#define DOUT20 67
#if (DOUT20_BIT < 32)
#define DOUT20_OUTREG OUT0
#define DOUT20_INREG IN0
#else
#define DOUT20_OUTREG OUT1
#define DOUT20_INREG IN1
#endif
#define DIO67 67
#define DIO67_BIT DOUT20_BIT
#define DIO67_OUTREG DOUT20_OUTREG
#define DIO67_INREG DOUT20_INREG
#endif
#if (defined(DOUT21_BIT))
#define DOUT21 68
#if (DOUT21_BIT < 32)
#define DOUT21_OUTREG OUT0
#define DOUT21_INREG IN0
#else
#define DOUT21_OUTREG OUT1
#define DOUT21_INREG IN1
#endif
#define DIO68 68
#define DIO68_BIT DOUT21_BIT
#define DIO68_OUTREG DOUT21_OUTREG
#define DIO68_INREG DOUT21_INREG
#endif
#if (defined(DOUT22_BIT))
#define DOUT22 69
#if (DOUT22_BIT < 32)
#define DOUT22_OUTREG OUT0
#define DOUT22_INREG IN0
#else
#define DOUT22_OUTREG OUT1
#define DOUT22_INREG IN1
#endif
#define DIO69 69
#define DIO69_BIT DOUT22_BIT
#define DIO69_OUTREG DOUT22_OUTREG
#define DIO69_INREG DOUT22_INREG
#endif
#if (defined(DOUT23_BIT))
#define DOUT23 70
#if (DOUT23_BIT < 32)
#define DOUT23_OUTREG OUT0
#define DOUT23_INREG IN0
#else
#define DOUT23_OUTREG OUT1
#define DOUT23_INREG IN1
#endif
#define DIO70 70
#define DIO70_BIT DOUT23_BIT
#define DIO70_OUTREG DOUT23_OUTREG
#define DIO70_INREG DOUT23_INREG
#endif
#if (defined(DOUT24_BIT))
#define DOUT24 71
#if (DOUT24_BIT < 32)
#define DOUT24_OUTREG OUT0
#define DOUT24_INREG IN0
#else
#define DOUT24_OUTREG OUT1
#define DOUT24_INREG IN1
#endif
#define DIO71 71
#define DIO71_BIT DOUT24_BIT
#define DIO71_OUTREG DOUT24_OUTREG
#define DIO71_INREG DOUT24_INREG
#endif
#if (defined(DOUT25_BIT))
#define DOUT25 72
#if (DOUT25_BIT < 32)
#define DOUT25_OUTREG OUT0
#define DOUT25_INREG IN0
#else
#define DOUT25_OUTREG OUT1
#define DOUT25_INREG IN1
#endif
#define DIO72 72
#define DIO72_BIT DOUT25_BIT
#define DIO72_OUTREG DOUT25_OUTREG
#define DIO72_INREG DOUT25_INREG
#endif
#if (defined(DOUT26_BIT))
#define DOUT26 73
#if (DOUT26_BIT < 32)
#define DOUT26_OUTREG OUT0
#define DOUT26_INREG IN0
#else
#define DOUT26_OUTREG OUT1
#define DOUT26_INREG IN1
#endif
#define DIO73 73
#define DIO73_BIT DOUT26_BIT
#define DIO73_OUTREG DOUT26_OUTREG
#define DIO73_INREG DOUT26_INREG
#endif
#if (defined(DOUT27_BIT))
#define DOUT27 74
#if (DOUT27_BIT < 32)
#define DOUT27_OUTREG OUT0
#define DOUT27_INREG IN0
#else
#define DOUT27_OUTREG OUT1
#define DOUT27_INREG IN1
#endif
#define DIO74 74
#define DIO74_BIT DOUT27_BIT
#define DIO74_OUTREG DOUT27_OUTREG
#define DIO74_INREG DOUT27_INREG
#endif
#if (defined(DOUT28_BIT))
#define DOUT28 75
#if (DOUT28_BIT < 32)
#define DOUT28_OUTREG OUT0
#define DOUT28_INREG IN0
#else
#define DOUT28_OUTREG OUT1
#define DOUT28_INREG IN1
#endif
#define DIO75 75
#define DIO75_BIT DOUT28_BIT
#define DIO75_OUTREG DOUT28_OUTREG
#define DIO75_INREG DOUT28_INREG
#endif
#if (defined(DOUT29_BIT))
#define DOUT29 76
#if (DOUT29_BIT < 32)
#define DOUT29_OUTREG OUT0
#define DOUT29_INREG IN0
#else
#define DOUT29_OUTREG OUT1
#define DOUT29_INREG IN1
#endif
#define DIO76 76
#define DIO76_BIT DOUT29_BIT
#define DIO76_OUTREG DOUT29_OUTREG
#define DIO76_INREG DOUT29_INREG
#endif
#if (defined(DOUT30_BIT))
#define DOUT30 77
#if (DOUT30_BIT < 32)
#define DOUT30_OUTREG OUT0
#define DOUT30_INREG IN0
#else
#define DOUT30_OUTREG OUT1
#define DOUT30_INREG IN1
#endif
#define DIO77 77
#define DIO77_BIT DOUT30_BIT
#define DIO77_OUTREG DOUT30_OUTREG
#define DIO77_INREG DOUT30_INREG
#endif
#if (defined(DOUT31_BIT))
#define DOUT31 78
#if (DOUT31_BIT < 32)
#define DOUT31_OUTREG OUT0
#define DOUT31_INREG IN0
#else
#define DOUT31_OUTREG OUT1
#define DOUT31_INREG IN1
#endif
#define DIO78 78
#define DIO78_BIT DOUT31_BIT
#define DIO78_OUTREG DOUT31_OUTREG
#define DIO78_INREG DOUT31_INREG
#endif
#if (defined(DOUT32_BIT))
#define DOUT32 79
#if (DOUT32_BIT < 32)
#define DOUT32_OUTREG OUT0
#define DOUT32_INREG IN0
#else
#define DOUT32_OUTREG OUT1
#define DOUT32_INREG IN1
#endif
#define DIO79 79
#define DIO79_BIT DOUT32_BIT
#define DIO79_OUTREG DOUT32_OUTREG
#define DIO79_INREG DOUT32_INREG
#endif
#if (defined(DOUT33_BIT))
#define DOUT33 80
#if (DOUT33_BIT < 32)
#define DOUT33_OUTREG OUT0
#define DOUT33_INREG IN0
#else
#define DOUT33_OUTREG OUT1
#define DOUT33_INREG IN1
#endif
#define DIO80 80
#define DIO80_BIT DOUT33_BIT
#define DIO80_OUTREG DOUT33_OUTREG
#define DIO80_INREG DOUT33_INREG
#endif
#if (defined(DOUT34_BIT))
#define DOUT34 81
#if (DOUT34_BIT < 32)
#define DOUT34_OUTREG OUT0
#define DOUT34_INREG IN0
#else
#define DOUT34_OUTREG OUT1
#define DOUT34_INREG IN1
#endif
#define DIO81 81
#define DIO81_BIT DOUT34_BIT
#define DIO81_OUTREG DOUT34_OUTREG
#define DIO81_INREG DOUT34_INREG
#endif
#if (defined(DOUT35_BIT))
#define DOUT35 82
#if (DOUT35_BIT < 32)
#define DOUT35_OUTREG OUT0
#define DOUT35_INREG IN0
#else
#define DOUT35_OUTREG OUT1
#define DOUT35_INREG IN1
#endif
#define DIO82 82
#define DIO82_BIT DOUT35_BIT
#define DIO82_OUTREG DOUT35_OUTREG
#define DIO82_INREG DOUT35_INREG
#endif
#if (defined(DOUT36_BIT))
#define DOUT36 83
#if (DOUT36_BIT < 32)
#define DOUT36_OUTREG OUT0
#define DOUT36_INREG IN0
#else
#define DOUT36_OUTREG OUT1
#define DOUT36_INREG IN1
#endif
#define DIO83 83
#define DIO83_BIT DOUT36_BIT
#define DIO83_OUTREG DOUT36_OUTREG
#define DIO83_INREG DOUT36_INREG
#endif
#if (defined(DOUT37_BIT))
#define DOUT37 84
#if (DOUT37_BIT < 32)
#define DOUT37_OUTREG OUT0
#define DOUT37_INREG IN0
#else
#define DOUT37_OUTREG OUT1
#define DOUT37_INREG IN1
#endif
#define DIO84 84
#define DIO84_BIT DOUT37_BIT
#define DIO84_OUTREG DOUT37_OUTREG
#define DIO84_INREG DOUT37_INREG
#endif
#if (defined(DOUT38_BIT))
#define DOUT38 85
#if (DOUT38_BIT < 32)
#define DOUT38_OUTREG OUT0
#define DOUT38_INREG IN0
#else
#define DOUT38_OUTREG OUT1
#define DOUT38_INREG IN1
#endif
#define DIO85 85
#define DIO85_BIT DOUT38_BIT
#define DIO85_OUTREG DOUT38_OUTREG
#define DIO85_INREG DOUT38_INREG
#endif
#if (defined(DOUT39_BIT))
#define DOUT39 86
#if (DOUT39_BIT < 32)
#define DOUT39_OUTREG OUT0
#define DOUT39_INREG IN0
#else
#define DOUT39_OUTREG OUT1
#define DOUT39_INREG IN1
#endif
#define DIO86 86
#define DIO86_BIT DOUT39_BIT
#define DIO86_OUTREG DOUT39_OUTREG
#define DIO86_INREG DOUT39_INREG
#endif
#if (defined(DOUT40_BIT))
#define DOUT40 87
#if (DOUT40_BIT < 32)
#define DOUT40_OUTREG OUT0
#define DOUT40_INREG IN0
#else
#define DOUT40_OUTREG OUT1
#define DOUT40_INREG IN1
#endif
#define DIO87 87
#define DIO87_BIT DOUT40_BIT
#define DIO87_OUTREG DOUT40_OUTREG
#define DIO87_INREG DOUT40_INREG
#endif
#if (defined(DOUT41_BIT))
#define DOUT41 88
#if (DOUT41_BIT < 32)
#define DOUT41_OUTREG OUT0
#define DOUT41_INREG IN0
#else
#define DOUT41_OUTREG OUT1
#define DOUT41_INREG IN1
#endif
#define DIO88 88
#define DIO88_BIT DOUT41_BIT
#define DIO88_OUTREG DOUT41_OUTREG
#define DIO88_INREG DOUT41_INREG
#endif
#if (defined(DOUT42_BIT))
#define DOUT42 89
#if (DOUT42_BIT < 32)
#define DOUT42_OUTREG OUT0
#define DOUT42_INREG IN0
#else
#define DOUT42_OUTREG OUT1
#define DOUT42_INREG IN1
#endif
#define DIO89 89
#define DIO89_BIT DOUT42_BIT
#define DIO89_OUTREG DOUT42_OUTREG
#define DIO89_INREG DOUT42_INREG
#endif
#if (defined(DOUT43_BIT))
#define DOUT43 90
#if (DOUT43_BIT < 32)
#define DOUT43_OUTREG OUT0
#define DOUT43_INREG IN0
#else
#define DOUT43_OUTREG OUT1
#define DOUT43_INREG IN1
#endif
#define DIO90 90
#define DIO90_BIT DOUT43_BIT
#define DIO90_OUTREG DOUT43_OUTREG
#define DIO90_INREG DOUT43_INREG
#endif
#if (defined(DOUT44_BIT))
#define DOUT44 91
#if (DOUT44_BIT < 32)
#define DOUT44_OUTREG OUT0
#define DOUT44_INREG IN0
#else
#define DOUT44_OUTREG OUT1
#define DOUT44_INREG IN1
#endif
#define DIO91 91
#define DIO91_BIT DOUT44_BIT
#define DIO91_OUTREG DOUT44_OUTREG
#define DIO91_INREG DOUT44_INREG
#endif
#if (defined(DOUT45_BIT))
#define DOUT45 92
#if (DOUT45_BIT < 32)
#define DOUT45_OUTREG OUT0
#define DOUT45_INREG IN0
#else
#define DOUT45_OUTREG OUT1
#define DOUT45_INREG IN1
#endif
#define DIO92 92
#define DIO92_BIT DOUT45_BIT
#define DIO92_OUTREG DOUT45_OUTREG
#define DIO92_INREG DOUT45_INREG
#endif
#if (defined(DOUT46_BIT))
#define DOUT46 93
#if (DOUT46_BIT < 32)
#define DOUT46_OUTREG OUT0
#define DOUT46_INREG IN0
#else
#define DOUT46_OUTREG OUT1
#define DOUT46_INREG IN1
#endif
#define DIO93 93
#define DIO93_BIT DOUT46_BIT
#define DIO93_OUTREG DOUT46_OUTREG
#define DIO93_INREG DOUT46_INREG
#endif
#if (defined(DOUT47_BIT))
#define DOUT47 94
#if (DOUT47_BIT < 32)
#define DOUT47_OUTREG OUT0
#define DOUT47_INREG IN0
#else
#define DOUT47_OUTREG OUT1
#define DOUT47_INREG IN1
#endif
#define DIO94 94
#define DIO94_BIT DOUT47_BIT
#define DIO94_OUTREG DOUT47_OUTREG
#define DIO94_INREG DOUT47_INREG
#endif
#if (defined(DOUT48_BIT))
#define DOUT48 95
#if (DOUT48_BIT < 32)
#define DOUT48_OUTREG OUT0
#define DOUT48_INREG IN0
#else
#define DOUT48_OUTREG OUT1
#define DOUT48_INREG IN1
#endif
#define DIO95 95
#define DIO95_BIT DOUT48_BIT
#define DIO95_OUTREG DOUT48_OUTREG
#define DIO95_INREG DOUT48_INREG
#endif
#if (defined(DOUT49_BIT))
#define DOUT49 96
#if (DOUT49_BIT < 32)
#define DOUT49_OUTREG OUT0
#define DOUT49_INREG IN0
#else
#define DOUT49_OUTREG OUT1
#define DOUT49_INREG IN1
#endif
#define DIO96 96
#define DIO96_BIT DOUT49_BIT
#define DIO96_OUTREG DOUT49_OUTREG
#define DIO96_INREG DOUT49_INREG
#endif
#if (defined(LIMIT_X_BIT))
#define LIMIT_X 100
#if (LIMIT_X_BIT < 32)
#define LIMIT_X_OUTREG OUT0
#define LIMIT_X_INREG IN0
#else
#define LIMIT_X_OUTREG OUT1
#define LIMIT_X_INREG IN1
#endif
#define DIO100 100
#define DIO100_BIT LIMIT_X_BIT
#define DIO100_OUTREG LIMIT_X_OUTREG
#define DIO100_INREG LIMIT_X_INREG
#endif
#if (defined(LIMIT_Y_BIT))
#define LIMIT_Y 101
#if (LIMIT_Y_BIT < 32)
#define LIMIT_Y_OUTREG OUT0
#define LIMIT_Y_INREG IN0
#else
#define LIMIT_Y_OUTREG OUT1
#define LIMIT_Y_INREG IN1
#endif
#define DIO101 101
#define DIO101_BIT LIMIT_Y_BIT
#define DIO101_OUTREG LIMIT_Y_OUTREG
#define DIO101_INREG LIMIT_Y_INREG
#endif
#if (defined(LIMIT_Z_BIT))
#define LIMIT_Z 102
#if (LIMIT_Z_BIT < 32)
#define LIMIT_Z_OUTREG OUT0
#define LIMIT_Z_INREG IN0
#else
#define LIMIT_Z_OUTREG OUT1
#define LIMIT_Z_INREG IN1
#endif
#define DIO102 102
#define DIO102_BIT LIMIT_Z_BIT
#define DIO102_OUTREG LIMIT_Z_OUTREG
#define DIO102_INREG LIMIT_Z_INREG
#endif
#if (defined(LIMIT_X2_BIT))
#define LIMIT_X2 103
#if (LIMIT_X2_BIT < 32)
#define LIMIT_X2_OUTREG OUT0
#define LIMIT_X2_INREG IN0
#else
#define LIMIT_X2_OUTREG OUT1
#define LIMIT_X2_INREG IN1
#endif
#define DIO103 103
#define DIO103_BIT LIMIT_X2_BIT
#define DIO103_OUTREG LIMIT_X2_OUTREG
#define DIO103_INREG LIMIT_X2_INREG
#endif
#if (defined(LIMIT_Y2_BIT))
#define LIMIT_Y2 104
#if (LIMIT_Y2_BIT < 32)
#define LIMIT_Y2_OUTREG OUT0
#define LIMIT_Y2_INREG IN0
#else
#define LIMIT_Y2_OUTREG OUT1
#define LIMIT_Y2_INREG IN1
#endif
#define DIO104 104
#define DIO104_BIT LIMIT_Y2_BIT
#define DIO104_OUTREG LIMIT_Y2_OUTREG
#define DIO104_INREG LIMIT_Y2_INREG
#endif
#if (defined(LIMIT_Z2_BIT))
#define LIMIT_Z2 105
#if (LIMIT_Z2_BIT < 32)
#define LIMIT_Z2_OUTREG OUT0
#define LIMIT_Z2_INREG IN0
#else
#define LIMIT_Z2_OUTREG OUT1
#define LIMIT_Z2_INREG IN1
#endif
#define DIO105 105
#define DIO105_BIT LIMIT_Z2_BIT
#define DIO105_OUTREG LIMIT_Z2_OUTREG
#define DIO105_INREG LIMIT_Z2_INREG
#endif
#if (defined(LIMIT_A_BIT))
#define LIMIT_A 106
#if (LIMIT_A_BIT < 32)
#define LIMIT_A_OUTREG OUT0
#define LIMIT_A_INREG IN0
#else
#define LIMIT_A_OUTREG OUT1
#define LIMIT_A_INREG IN1
#endif
#define DIO106 106
#define DIO106_BIT LIMIT_A_BIT
#define DIO106_OUTREG LIMIT_A_OUTREG
#define DIO106_INREG LIMIT_A_INREG
#endif
#if (defined(LIMIT_B_BIT))
#define LIMIT_B 107
#if (LIMIT_B_BIT < 32)
#define LIMIT_B_OUTREG OUT0
#define LIMIT_B_INREG IN0
#else
#define LIMIT_B_OUTREG OUT1
#define LIMIT_B_INREG IN1
#endif
#define DIO107 107
#define DIO107_BIT LIMIT_B_BIT
#define DIO107_OUTREG LIMIT_B_OUTREG
#define DIO107_INREG LIMIT_B_INREG
#endif
#if (defined(LIMIT_C_BIT))
#define LIMIT_C 108
#if (LIMIT_C_BIT < 32)
#define LIMIT_C_OUTREG OUT0
#define LIMIT_C_INREG IN0
#else
#define LIMIT_C_OUTREG OUT1
#define LIMIT_C_INREG IN1
#endif
#define DIO108 108
#define DIO108_BIT LIMIT_C_BIT
#define DIO108_OUTREG LIMIT_C_OUTREG
#define DIO108_INREG LIMIT_C_INREG
#endif
#if (defined(PROBE_BIT))
#define PROBE 109
#if (PROBE_BIT < 32)
#define PROBE_OUTREG OUT0
#define PROBE_INREG IN0
#else
#define PROBE_OUTREG OUT1
#define PROBE_INREG IN1
#endif
#define DIO109 109
#define DIO109_BIT PROBE_BIT
#define DIO109_OUTREG PROBE_OUTREG
#define DIO109_INREG PROBE_INREG
#endif
#if (defined(ESTOP_BIT))
#define ESTOP 110
#if (ESTOP_BIT < 32)
#define ESTOP_OUTREG OUT0
#define ESTOP_INREG IN0
#else
#define ESTOP_OUTREG OUT1
#define ESTOP_INREG IN1
#endif
#define DIO110 110
#define DIO110_BIT ESTOP_BIT
#define DIO110_OUTREG ESTOP_OUTREG
#define DIO110_INREG ESTOP_INREG
#endif
#if (defined(SAFETY_DOOR_BIT))
#define SAFETY_DOOR 111
#if (SAFETY_DOOR_BIT < 32)
#define SAFETY_DOOR_OUTREG OUT0
#define SAFETY_DOOR_INREG IN0
#else
#define SAFETY_DOOR_OUTREG OUT1
#define SAFETY_DOOR_INREG IN1
#endif
#define DIO111 111
#define DIO111_BIT SAFETY_DOOR_BIT
#define DIO111_OUTREG SAFETY_DOOR_OUTREG
#define DIO111_INREG SAFETY_DOOR_INREG
#endif
#if (defined(FHOLD_BIT))
#define FHOLD 112
#if (FHOLD_BIT < 32)
#define FHOLD_OUTREG OUT0
#define FHOLD_INREG IN0
#else
#define FHOLD_OUTREG OUT1
#define FHOLD_INREG IN1
#endif
#define DIO112 112
#define DIO112_BIT FHOLD_BIT
#define DIO112_OUTREG FHOLD_OUTREG
#define DIO112_INREG FHOLD_INREG
#endif
#if (defined(CS_RES_BIT))
#define CS_RES 113
#if (CS_RES_BIT < 32)
#define CS_RES_OUTREG OUT0
#define CS_RES_INREG IN0
#else
#define CS_RES_OUTREG OUT1
#define CS_RES_INREG IN1
#endif
#define DIO113 113
#define DIO113_BIT CS_RES_BIT
#define DIO113_OUTREG CS_RES_OUTREG
#define DIO113_INREG CS_RES_INREG
#endif
#if (defined(ANALOG0_BIT))
#define ANALOG0 114
#if (ANALOG0_BIT < 32)
#define ANALOG0_OUTREG OUT0
#define ANALOG0_INREG IN0
#else
#define ANALOG0_OUTREG OUT1
#define ANALOG0_INREG IN1
#endif
#define DIO114 114
#define DIO114_BIT ANALOG0_BIT
#define DIO114_OUTREG ANALOG0_OUTREG
#define DIO114_INREG ANALOG0_INREG
#endif
#if (defined(ANALOG1_BIT))
#define ANALOG1 115
#if (ANALOG1_BIT < 32)
#define ANALOG1_OUTREG OUT0
#define ANALOG1_INREG IN0
#else
#define ANALOG1_OUTREG OUT1
#define ANALOG1_INREG IN1
#endif
#define DIO115 115
#define DIO115_BIT ANALOG1_BIT
#define DIO115_OUTREG ANALOG1_OUTREG
#define DIO115_INREG ANALOG1_INREG
#endif
#if (defined(ANALOG2_BIT))
#define ANALOG2 116
#if (ANALOG2_BIT < 32)
#define ANALOG2_OUTREG OUT0
#define ANALOG2_INREG IN0
#else
#define ANALOG2_OUTREG OUT1
#define ANALOG2_INREG IN1
#endif
#define DIO116 116
#define DIO116_BIT ANALOG2_BIT
#define DIO116_OUTREG ANALOG2_OUTREG
#define DIO116_INREG ANALOG2_INREG
#endif
#if (defined(ANALOG3_BIT))
#define ANALOG3 117
#if (ANALOG3_BIT < 32)
#define ANALOG3_OUTREG OUT0
#define ANALOG3_INREG IN0
#else
#define ANALOG3_OUTREG OUT1
#define ANALOG3_INREG IN1
#endif
#define DIO117 117
#define DIO117_BIT ANALOG3_BIT
#define DIO117_OUTREG ANALOG3_OUTREG
#define DIO117_INREG ANALOG3_INREG
#endif
#if (defined(ANALOG4_BIT))
#define ANALOG4 118
#if (ANALOG4_BIT < 32)
#define ANALOG4_OUTREG OUT0
#define ANALOG4_INREG IN0
#else
#define ANALOG4_OUTREG OUT1
#define ANALOG4_INREG IN1
#endif
#define DIO118 118
#define DIO118_BIT ANALOG4_BIT
#define DIO118_OUTREG ANALOG4_OUTREG
#define DIO118_INREG ANALOG4_INREG
#endif
#if (defined(ANALOG5_BIT))
#define ANALOG5 119
#if (ANALOG5_BIT < 32)
#define ANALOG5_OUTREG OUT0
#define ANALOG5_INREG IN0
#else
#define ANALOG5_OUTREG OUT1
#define ANALOG5_INREG IN1
#endif
#define DIO119 119
#define DIO119_BIT ANALOG5_BIT
#define DIO119_OUTREG ANALOG5_OUTREG
#define DIO119_INREG ANALOG5_INREG
#endif
#if (defined(ANALOG6_BIT))
#define ANALOG6 120
#if (ANALOG6_BIT < 32)
#define ANALOG6_OUTREG OUT0
#define ANALOG6_INREG IN0
#else
#define ANALOG6_OUTREG OUT1
#define ANALOG6_INREG IN1
#endif
#define DIO120 120
#define DIO120_BIT ANALOG6_BIT
#define DIO120_OUTREG ANALOG6_OUTREG
#define DIO120_INREG ANALOG6_INREG
#endif
#if (defined(ANALOG7_BIT))
#define ANALOG7 121
#if (ANALOG7_BIT < 32)
#define ANALOG7_OUTREG OUT0
#define ANALOG7_INREG IN0
#else
#define ANALOG7_OUTREG OUT1
#define ANALOG7_INREG IN1
#endif
#define DIO121 121
#define DIO121_BIT ANALOG7_BIT
#define DIO121_OUTREG ANALOG7_OUTREG
#define DIO121_INREG ANALOG7_INREG
#endif
#if (defined(ANALOG8_BIT))
#define ANALOG8 122
#if (ANALOG8_BIT < 32)
#define ANALOG8_OUTREG OUT0
#define ANALOG8_INREG IN0
#else
#define ANALOG8_OUTREG OUT1
#define ANALOG8_INREG IN1
#endif
#define DIO122 122
#define DIO122_BIT ANALOG8_BIT
#define DIO122_OUTREG ANALOG8_OUTREG
#define DIO122_INREG ANALOG8_INREG
#endif
#if (defined(ANALOG9_BIT))
#define ANALOG9 123
#if (ANALOG9_BIT < 32)
#define ANALOG9_OUTREG OUT0
#define ANALOG9_INREG IN0
#else
#define ANALOG9_OUTREG OUT1
#define ANALOG9_INREG IN1
#endif
#define DIO123 123
#define DIO123_BIT ANALOG9_BIT
#define DIO123_OUTREG ANALOG9_OUTREG
#define DIO123_INREG ANALOG9_INREG
#endif
#if (defined(ANALOG10_BIT))
#define ANALOG10 124
#if (ANALOG10_BIT < 32)
#define ANALOG10_OUTREG OUT0
#define ANALOG10_INREG IN0
#else
#define ANALOG10_OUTREG OUT1
#define ANALOG10_INREG IN1
#endif
#define DIO124 124
#define DIO124_BIT ANALOG10_BIT
#define DIO124_OUTREG ANALOG10_OUTREG
#define DIO124_INREG ANALOG10_INREG
#endif
#if (defined(ANALOG11_BIT))
#define ANALOG11 125
#if (ANALOG11_BIT < 32)
#define ANALOG11_OUTREG OUT0
#define ANALOG11_INREG IN0
#else
#define ANALOG11_OUTREG OUT1
#define ANALOG11_INREG IN1
#endif
#define DIO125 125
#define DIO125_BIT ANALOG11_BIT
#define DIO125_OUTREG ANALOG11_OUTREG
#define DIO125_INREG ANALOG11_INREG
#endif
#if (defined(ANALOG12_BIT))
#define ANALOG12 126
#if (ANALOG12_BIT < 32)
#define ANALOG12_OUTREG OUT0
#define ANALOG12_INREG IN0
#else
#define ANALOG12_OUTREG OUT1
#define ANALOG12_INREG IN1
#endif
#define DIO126 126
#define DIO126_BIT ANALOG12_BIT
#define DIO126_OUTREG ANALOG12_OUTREG
#define DIO126_INREG ANALOG12_INREG
#endif
#if (defined(ANALOG13_BIT))
#define ANALOG13 127
#if (ANALOG13_BIT < 32)
#define ANALOG13_OUTREG OUT0
#define ANALOG13_INREG IN0
#else
#define ANALOG13_OUTREG OUT1
#define ANALOG13_INREG IN1
#endif
#define DIO127 127
#define DIO127_BIT ANALOG13_BIT
#define DIO127_OUTREG ANALOG13_OUTREG
#define DIO127_INREG ANALOG13_INREG
#endif
#if (defined(ANALOG14_BIT))
#define ANALOG14 128
#if (ANALOG14_BIT < 32)
#define ANALOG14_OUTREG OUT0
#define ANALOG14_INREG IN0
#else
#define ANALOG14_OUTREG OUT1
#define ANALOG14_INREG IN1
#endif
#define DIO128 128
#define DIO128_BIT ANALOG14_BIT
#define DIO128_OUTREG ANALOG14_OUTREG
#define DIO128_INREG ANALOG14_INREG
#endif
#if (defined(ANALOG15_BIT))
#define ANALOG15 129
#if (ANALOG15_BIT < 32)
#define ANALOG15_OUTREG OUT0
#define ANALOG15_INREG IN0
#else
#define ANALOG15_OUTREG OUT1
#define ANALOG15_INREG IN1
#endif
#define DIO129 129
#define DIO129_BIT ANALOG15_BIT
#define DIO129_OUTREG ANALOG15_OUTREG
#define DIO129_INREG ANALOG15_INREG
#endif
#if (defined(DIN0_BIT))
#define DIN0 130
#if (DIN0_BIT < 32)
#define DIN0_OUTREG OUT0
#define DIN0_INREG IN0
#else
#define DIN0_OUTREG OUT1
#define DIN0_INREG IN1
#endif
#define DIO130 130
#define DIO130_BIT DIN0_BIT
#define DIO130_OUTREG DIN0_OUTREG
#define DIO130_INREG DIN0_INREG
#endif
#if (defined(DIN1_BIT))
#define DIN1 131
#if (DIN1_BIT < 32)
#define DIN1_OUTREG OUT0
#define DIN1_INREG IN0
#else
#define DIN1_OUTREG OUT1
#define DIN1_INREG IN1
#endif
#define DIO131 131
#define DIO131_BIT DIN1_BIT
#define DIO131_OUTREG DIN1_OUTREG
#define DIO131_INREG DIN1_INREG
#endif
#if (defined(DIN2_BIT))
#define DIN2 132
#if (DIN2_BIT < 32)
#define DIN2_OUTREG OUT0
#define DIN2_INREG IN0
#else
#define DIN2_OUTREG OUT1
#define DIN2_INREG IN1
#endif
#define DIO132 132
#define DIO132_BIT DIN2_BIT
#define DIO132_OUTREG DIN2_OUTREG
#define DIO132_INREG DIN2_INREG
#endif
#if (defined(DIN3_BIT))
#define DIN3 133
#if (DIN3_BIT < 32)
#define DIN3_OUTREG OUT0
#define DIN3_INREG IN0
#else
#define DIN3_OUTREG OUT1
#define DIN3_INREG IN1
#endif
#define DIO133 133
#define DIO133_BIT DIN3_BIT
#define DIO133_OUTREG DIN3_OUTREG
#define DIO133_INREG DIN3_INREG
#endif
#if (defined(DIN4_BIT))
#define DIN4 134
#if (DIN4_BIT < 32)
#define DIN4_OUTREG OUT0
#define DIN4_INREG IN0
#else
#define DIN4_OUTREG OUT1
#define DIN4_INREG IN1
#endif
#define DIO134 134
#define DIO134_BIT DIN4_BIT
#define DIO134_OUTREG DIN4_OUTREG
#define DIO134_INREG DIN4_INREG
#endif
#if (defined(DIN5_BIT))
#define DIN5 135
#if (DIN5_BIT < 32)
#define DIN5_OUTREG OUT0
#define DIN5_INREG IN0
#else
#define DIN5_OUTREG OUT1
#define DIN5_INREG IN1
#endif
#define DIO135 135
#define DIO135_BIT DIN5_BIT
#define DIO135_OUTREG DIN5_OUTREG
#define DIO135_INREG DIN5_INREG
#endif
#if (defined(DIN6_BIT))
#define DIN6 136
#if (DIN6_BIT < 32)
#define DIN6_OUTREG OUT0
#define DIN6_INREG IN0
#else
#define DIN6_OUTREG OUT1
#define DIN6_INREG IN1
#endif
#define DIO136 136
#define DIO136_BIT DIN6_BIT
#define DIO136_OUTREG DIN6_OUTREG
#define DIO136_INREG DIN6_INREG
#endif
#if (defined(DIN7_BIT))
#define DIN7 137
#if (DIN7_BIT < 32)
#define DIN7_OUTREG OUT0
#define DIN7_INREG IN0
#else
#define DIN7_OUTREG OUT1
#define DIN7_INREG IN1
#endif
#define DIO137 137
#define DIO137_BIT DIN7_BIT
#define DIO137_OUTREG DIN7_OUTREG
#define DIO137_INREG DIN7_INREG
#endif
#if (defined(DIN8_BIT))
#define DIN8 138
#if (DIN8_BIT < 32)
#define DIN8_OUTREG OUT0
#define DIN8_INREG IN0
#else
#define DIN8_OUTREG OUT1
#define DIN8_INREG IN1
#endif
#define DIO138 138
#define DIO138_BIT DIN8_BIT
#define DIO138_OUTREG DIN8_OUTREG
#define DIO138_INREG DIN8_INREG
#endif
#if (defined(DIN9_BIT))
#define DIN9 139
#if (DIN9_BIT < 32)
#define DIN9_OUTREG OUT0
#define DIN9_INREG IN0
#else
#define DIN9_OUTREG OUT1
#define DIN9_INREG IN1
#endif
#define DIO139 139
#define DIO139_BIT DIN9_BIT
#define DIO139_OUTREG DIN9_OUTREG
#define DIO139_INREG DIN9_INREG
#endif
#if (defined(DIN10_BIT))
#define DIN10 140
#if (DIN10_BIT < 32)
#define DIN10_OUTREG OUT0
#define DIN10_INREG IN0
#else
#define DIN10_OUTREG OUT1
#define DIN10_INREG IN1
#endif
#define DIO140 140
#define DIO140_BIT DIN10_BIT
#define DIO140_OUTREG DIN10_OUTREG
#define DIO140_INREG DIN10_INREG
#endif
#if (defined(DIN11_BIT))
#define DIN11 141
#if (DIN11_BIT < 32)
#define DIN11_OUTREG OUT0
#define DIN11_INREG IN0
#else
#define DIN11_OUTREG OUT1
#define DIN11_INREG IN1
#endif
#define DIO141 141
#define DIO141_BIT DIN11_BIT
#define DIO141_OUTREG DIN11_OUTREG
#define DIO141_INREG DIN11_INREG
#endif
#if (defined(DIN12_BIT))
#define DIN12 142
#if (DIN12_BIT < 32)
#define DIN12_OUTREG OUT0
#define DIN12_INREG IN0
#else
#define DIN12_OUTREG OUT1
#define DIN12_INREG IN1
#endif
#define DIO142 142
#define DIO142_BIT DIN12_BIT
#define DIO142_OUTREG DIN12_OUTREG
#define DIO142_INREG DIN12_INREG
#endif
#if (defined(DIN13_BIT))
#define DIN13 143
#if (DIN13_BIT < 32)
#define DIN13_OUTREG OUT0
#define DIN13_INREG IN0
#else
#define DIN13_OUTREG OUT1
#define DIN13_INREG IN1
#endif
#define DIO143 143
#define DIO143_BIT DIN13_BIT
#define DIO143_OUTREG DIN13_OUTREG
#define DIO143_INREG DIN13_INREG
#endif
#if (defined(DIN14_BIT))
#define DIN14 144
#if (DIN14_BIT < 32)
#define DIN14_OUTREG OUT0
#define DIN14_INREG IN0
#else
#define DIN14_OUTREG OUT1
#define DIN14_INREG IN1
#endif
#define DIO144 144
#define DIO144_BIT DIN14_BIT
#define DIO144_OUTREG DIN14_OUTREG
#define DIO144_INREG DIN14_INREG
#endif
#if (defined(DIN15_BIT))
#define DIN15 145
#if (DIN15_BIT < 32)
#define DIN15_OUTREG OUT0
#define DIN15_INREG IN0
#else
#define DIN15_OUTREG OUT1
#define DIN15_INREG IN1
#endif
#define DIO145 145
#define DIO145_BIT DIN15_BIT
#define DIO145_OUTREG DIN15_OUTREG
#define DIO145_INREG DIN15_INREG
#endif
