Paciente8159/uCNC/uCNC/src/hal/mcus/esp32/mcumap_esp32.h
#ifdef PWM0_CHANNEL
#define PWM0_LEDCCHANNEL (PWM0_CHANNEL & 0x07)
#if (PWM0_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM0_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM0_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO25_CHANNEL PWM0_CHANNEL
#define DIO25_TIMER PWM0_TIMER
#define DIO25_LEDCCHANNEL PWM0_LEDCCHANNEL
#define DIO25_SPEEDMODE PWM0_SPEEDMODE
#endif
#ifdef PWM1_CHANNEL
#define PWM1_LEDCCHANNEL (PWM1_CHANNEL & 0x07)
#if (PWM1_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM1_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM1_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO26_CHANNEL PWM1_CHANNEL
#define DIO26_TIMER PWM1_TIMER
#define DIO26_LEDCCHANNEL PWM1_LEDCCHANNEL
#define DIO26_SPEEDMODE PWM1_SPEEDMODE
#endif
#ifdef PWM2_CHANNEL
#define PWM2_LEDCCHANNEL (PWM2_CHANNEL & 0x07)
#if (PWM2_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM2_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM2_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO27_CHANNEL PWM2_CHANNEL
#define DIO27_TIMER PWM2_TIMER
#define DIO27_LEDCCHANNEL PWM2_LEDCCHANNEL
#define DIO27_SPEEDMODE PWM2_SPEEDMODE
#endif
#ifdef PWM3_CHANNEL
#define PWM3_LEDCCHANNEL (PWM3_CHANNEL & 0x07)
#if (PWM3_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM3_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM3_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO28_CHANNEL PWM3_CHANNEL
#define DIO28_TIMER PWM3_TIMER
#define DIO28_LEDCCHANNEL PWM3_LEDCCHANNEL
#define DIO28_SPEEDMODE PWM3_SPEEDMODE
#endif
#ifdef PWM4_CHANNEL
#define PWM4_LEDCCHANNEL (PWM4_CHANNEL & 0x07)
#if (PWM4_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM4_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM4_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO29_CHANNEL PWM4_CHANNEL
#define DIO29_TIMER PWM4_TIMER
#define DIO29_LEDCCHANNEL PWM4_LEDCCHANNEL
#define DIO29_SPEEDMODE PWM4_SPEEDMODE
#endif
#ifdef PWM5_CHANNEL
#define PWM5_LEDCCHANNEL (PWM5_CHANNEL & 0x07)
#if (PWM5_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM5_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM5_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO30_CHANNEL PWM5_CHANNEL
#define DIO30_TIMER PWM5_TIMER
#define DIO30_LEDCCHANNEL PWM5_LEDCCHANNEL
#define DIO30_SPEEDMODE PWM5_SPEEDMODE
#endif
#ifdef PWM6_CHANNEL
#define PWM6_LEDCCHANNEL (PWM6_CHANNEL & 0x07)
#if (PWM6_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM6_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM6_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO31_CHANNEL PWM6_CHANNEL
#define DIO31_TIMER PWM6_TIMER
#define DIO31_LEDCCHANNEL PWM6_LEDCCHANNEL
#define DIO31_SPEEDMODE PWM6_SPEEDMODE
#endif
#ifdef PWM7_CHANNEL
#define PWM7_LEDCCHANNEL (PWM7_CHANNEL & 0x07)
#if (PWM7_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM7_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM7_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO32_CHANNEL PWM7_CHANNEL
#define DIO32_TIMER PWM7_TIMER
#define DIO32_LEDCCHANNEL PWM7_LEDCCHANNEL
#define DIO32_SPEEDMODE PWM7_SPEEDMODE
#endif
#ifdef PWM8_CHANNEL
#define PWM8_LEDCCHANNEL (PWM8_CHANNEL & 0x07)
#if (PWM8_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM8_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM8_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO33_CHANNEL PWM8_CHANNEL
#define DIO33_TIMER PWM8_TIMER
#define DIO33_LEDCCHANNEL PWM8_LEDCCHANNEL
#define DIO33_SPEEDMODE PWM8_SPEEDMODE
#endif
#ifdef PWM9_CHANNEL
#define PWM9_LEDCCHANNEL (PWM9_CHANNEL & 0x07)
#if (PWM9_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM9_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM9_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO34_CHANNEL PWM9_CHANNEL
#define DIO34_TIMER PWM9_TIMER
#define DIO34_LEDCCHANNEL PWM9_LEDCCHANNEL
#define DIO34_SPEEDMODE PWM9_SPEEDMODE
#endif
#ifdef PWM10_CHANNEL
#define PWM10_LEDCCHANNEL (PWM10_CHANNEL & 0x07)
#if (PWM10_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM10_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM10_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO35_CHANNEL PWM10_CHANNEL
#define DIO35_TIMER PWM10_TIMER
#define DIO35_LEDCCHANNEL PWM10_LEDCCHANNEL
#define DIO35_SPEEDMODE PWM10_SPEEDMODE
#endif
#ifdef PWM11_CHANNEL
#define PWM11_LEDCCHANNEL (PWM11_CHANNEL & 0x07)
#if (PWM11_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM11_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM11_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO36_CHANNEL PWM11_CHANNEL
#define DIO36_TIMER PWM11_TIMER
#define DIO36_LEDCCHANNEL PWM11_LEDCCHANNEL
#define DIO36_SPEEDMODE PWM11_SPEEDMODE
#endif
#ifdef PWM12_CHANNEL
#define PWM12_LEDCCHANNEL (PWM12_CHANNEL & 0x07)
#if (PWM12_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM12_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM12_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO37_CHANNEL PWM12_CHANNEL
#define DIO37_TIMER PWM12_TIMER
#define DIO37_LEDCCHANNEL PWM12_LEDCCHANNEL
#define DIO37_SPEEDMODE PWM12_SPEEDMODE
#endif
#ifdef PWM13_CHANNEL
#define PWM13_LEDCCHANNEL (PWM13_CHANNEL & 0x07)
#if (PWM13_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM13_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM13_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO38_CHANNEL PWM13_CHANNEL
#define DIO38_TIMER PWM13_TIMER
#define DIO38_LEDCCHANNEL PWM13_LEDCCHANNEL
#define DIO38_SPEEDMODE PWM13_SPEEDMODE
#endif
#ifdef PWM14_CHANNEL
#define PWM14_LEDCCHANNEL (PWM14_CHANNEL & 0x07)
#if (PWM14_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM14_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM14_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO39_CHANNEL PWM14_CHANNEL
#define DIO39_TIMER PWM14_TIMER
#define DIO39_LEDCCHANNEL PWM14_LEDCCHANNEL
#define DIO39_SPEEDMODE PWM14_SPEEDMODE
#endif
#ifdef PWM15_CHANNEL
#define PWM15_LEDCCHANNEL (PWM15_CHANNEL & 0x07)
#if (PWM15_CHANNEL < 8) && SOC_LEDC_SUPPORT_HS_MODE
#define PWM15_SPEEDMODE LEDC_HIGH_SPEED_MODE
#else
#define PWM15_SPEEDMODE LEDC_LOW_SPEED_MODE
#endif
#define DIO40_CHANNEL PWM15_CHANNEL
#define DIO40_TIMER PWM15_TIMER
#define DIO40_LEDCCHANNEL PWM15_LEDCCHANNEL
#define DIO40_SPEEDMODE PWM15_SPEEDMODE
#endif

#if (defined(TX) && defined(RX))
#define MCU_HAS_UART
#ifndef UART_PORT
#define UART_PORT 0
#endif
#endif
#if (defined(TX2) && defined(RX2))
#define MCU_HAS_UART2
#ifndef UART2_PORT
#define UART2_PORT 0
#endif
#ifndef BAUDRATE2
#define BAUDRATE2 BAUDRATE
#endif
#endif
#if (defined(USB_DP) && defined(USB_DM))
#define MCU_HAS_USB
#endif
#ifdef ENABLE_WIFI
#ifndef ENABLE_SOCKETS
#define ENABLE_SOCKETS
#endif
#endif

#ifdef ENABLE_SOCKETS
#ifndef MCU_HAS_FLASHUPDATE
#define MCU_HAS_FLASHUPDATE
#endif
#ifndef BOARD_HAS_CUSTOM_SYSTEM_COMMANDS
#define BOARD_HAS_CUSTOM_SYSTEM_COMMANDS
#endif
#define MCU_HAS_RTOS
#define sockets_dotasks() ({})
#endif
#ifdef ENABLE_BLUETOOTH
#define MCU_HAS_BLUETOOTH
#ifndef BOARD_HAS_CUSTOM_SYSTEM_COMMANDS
#define BOARD_HAS_CUSTOM_SYSTEM_COMMANDS
#endif
#endif

// servo timer is also used by emulated PWM if used
#ifndef SERVO_TIMER
#define SERVO_TIMER 1
#endif
#if !(SERVO_TIMER & 0x02)
#define SERVO_TIMER_TG 0
#else
#define SERVO_TIMER_TG 1
#endif
#if !(SERVO_TIMER & 0x01)
#define SERVO_TIMER_IDX 0
#else
#define SERVO_TIMER_IDX 1
#endif

#ifndef ITP_TIMER
#define ITP_TIMER 3
#endif
#if !(ITP_TIMER & 0x02)
#define ITP_TIMER_TG 0
#else
#define ITP_TIMER_TG 1
#endif
#if !(ITP_TIMER & 0x01)
#define ITP_TIMER_IDX 0
#else
#define ITP_TIMER_IDX 1
#endif

